Repository: MichMatrix/APA_Learn
Catalog: lib/l10n/app_*.arb
Languages: pt

# splashSubtitle
source: Fun + Algorithms
pt: Diversão + Algoritmos

source: Loading...
pt: Carregando...

# splashFooter
source: v0.1 • Knapsack module
pt: v0.1 • módulo Mochila

source: Profile
pt: Perfil

source: Settings
pt: Configurações

source: Language
pt: Idioma

source: Portuguese
pt: Português

source: English
pt: Inglês

source: Version
pt: Versão

# updateTitle
source: Update Required
pt: Atualização necessária

# updateMessage
source: A new version of the app is available with important improvements and fixes. Please update now to continue.
pt: Uma nova versão do app já está disponível com melhorias e correções importantes. Para continuar usando, atualize agora pela loja.

# updateButton
source: Update Now
pt: Atualizar agora

# updateLater
source: Later
pt: Depois

# updateIgnore
source: Ignore
pt: Ignorar

source: Modules
pt: Módulos

# homeHeroSubtitle
source: Learn algorithms like a game.
pt: Aprenda algoritmos como um jogos

# difficultyEasy
source: Easy
pt: Fácil

# difficultyMedium
source: Medium
pt: Médio

# difficultyHard
source: Hard
pt: Difícil

# btnGuide
source: Guide
pt: Guia

# btnPlay
source: Play
pt: Jogar

# knapsackTitle
source: Knapsack Problem
pt: Problema da Mochila

# knapsackSubtitle
source: Pick items and maximize value without exceeding capacity.
pt: Escolha itens e maximize o valor sem estourar a capacidade.

# tspTitle
source: Traveling Salesman Problem
pt: Problema do Caixeiro Viajante

# tspSubtitle
source: Find the shortest route visiting all cities and returning to the start.
pt: Encontre o menor caminho para visitar todas as cidades e voltar ao início.

# knapsackIntroAppBarTitle
source: Knapsack Problem
pt: Problema da Mochila

# knapsackIntroChooseDifficulty
source: Choose your difficulty
pt: Escolha sua dificuldade

# knapsackIntroStartMission
source: Start mission
pt: Começar missão

# knapsackIntroHintBeginner
source: Tip: focus on items with high value and low weight.
pt: Dica: foque em itens com alto valor e baixo peso.

# knapsackIntroHintIntermediate
source: Tip: the highest value doesn't always win. Think about combinations.
pt: Dica: nem sempre o maior valor vence. Pense na combinação.

# knapsackIntroHintAdvanced
source: Tip: maximize efficiency (value/weight).
pt: Dica: maximize eficiência (valor/peso).

# knapsackIntroHeaderText
source: Choose items with weight and value. Maximize value without exceeding capacity.
pt: Escolha itens com peso e valor. Maximize o valor sem estourar a capacidade.

# capacityCardTitle
source: Backpack capacity
pt: Capacidade da mochila

# capacityCardSubtitle
source: Adjust capacity to make the challenge your way.
pt: Ajuste a capacidade para o desafio ficar do seu jeito.

# difficultyTagItems
source: Items: up to {count}
pt: Itens: até {count}

# difficultyTagHints
source: Hints
pt: Dicas

# difficultyTagTimer
source: Timer
pt: Tempo

# valueLabel
source: Value
pt: Valor

# weightLabel
source: Weight: {used} / {capacity}
pt: Peso: {used} / {capacity}

# knapsackBoardingTitle
source: Knapsack Problem
pt: Problema da Mochila

# knapsackBoardingSubtitle
source: You are an explorer and found treasures! But your backpack has a weight limit.
pt: Você é um explorador e encontrou tesouros! Mas sua mochila tem limite de peso.

# knapsackBoardingHighlight
source: Pick the right items to maximize your treasure!
pt: Escolha os itens certos para maximizar seu tesouro!

# knapsackBoardingObjectiveTitle
source: Objective
pt: Objetivo

# knapsackBoardingObjectiveText
source: Select items for your backpack respecting the weight limit and maximizing total value!
pt: Selecione itens para colocar na mochila respeitando o limite de peso e maximizando o valor total!

# knapsackBoardingPillWeight
source: Weight Limit
pt: Peso Limite

# knapsackBoardingPillValue
source: Max Value
pt: Valor Máximo

# knapsackBoardingCta
source: Start Adventure
pt: Começar Aventura

# knapsackDifficultyBeginnerTitle
source: Beginner
pt: Iniciante

# knapsackDifficultyBeginnerSubtitle
source: Fewer items, hints, and no pressure.
pt: Poucos itens, dicas e sem pressão.

# knapsackDifficultyIntermediateTitle
source: Intermediate
pt: Intermediário

# knapsackDifficultyIntermediateSubtitle
source: More items and tougher choices.
pt: Mais itens e escolhas mais difíceis.

# knapsackDifficultyAdvancedTitle
source: Advanced
pt: Avançado

# knapsackDifficultyAdvancedSubtitle
source: Real challenge: more items and fewer hints.
pt: Desafio real: mais itens e menos dicas.

# knapsackItemCoin
source: Coin
pt: Moeda

# knapsackItemGem
source: Gem
pt: Gema

# knapsackItemBook
source: Book
pt: Livro

# knapsackItemPhone
source: Phone
pt: Celular

# knapsackItemWatch
source: Watch
pt: Relógio

# knapsackItemHeadphone
source: Headphones
pt: Fone

# knapsackGuideTitle
source: Guide: Knapsack Problem
pt: Guia: Problema da Mochila

source: Context
pt: Contexto

# whyHard
source: Why is it hard?
pt: Por que é difícil?

# howBecomesGame
source: How does it become a game?
pt: Como vira um jogo?

source: Common algorithms
pt: Algoritmos comuns

# knapsackGuideContextText
source: Imagine you are traveling and can only carry a backpack with limited weight. Each item has weight and value. The goal is to maximize total value without exceeding capacity.
pt: Imagine que você vai viajar e só pode levar uma mochila com limite de peso. Cada item tem peso e valor. O objetivo é maximizar o valor sem ultrapassar a capacidade.

# knapsackGuideWhyHardText
source: Testing all possible combinations grows exponentially. That’s why the problem is NP-hard.
pt: Testar todas as combinações cresce exponencialmente. Por isso é considerado NP-hard.

# knapsackGuideHowGameText
source: You drag items into the backpack. Try to reach the optimal value. Higher levels may include timers and fewer hints.
pt: Você arrasta itens para a mochila. Tente chegar o mais próximo possível do valor ótimo. Níveis mais difíceis podem ter tempo e menos dicas.

# greedyTitle
source: Greedy
pt: Guloso

# greedySubtitle
source: Fast, but may miss the optimal solution
pt: Rápido, mas pode não achar o ótimo

# greedyBullet1
source: Select by best value/weight ratio
pt: Escolhe pelo melhor valor/peso

# greedyBullet2
source: Very fast (good approximation)
pt: Muito rápido (boa aproximação)

# greedyBullet3
source: May fail in some cases
pt: Pode falhar em casos específicos

# approxBadge
source: Approximation
pt: Aproximação

# dpTitle
source: Dynamic Programming (DP)
pt: Programação Dinâmica (DP)

# dpSubtitle
source: Finds the optimal solution for 0/1 knapsack
pt: Encontra a solução ótima no 0/1

# dpBullet1
source: Builds a dp[item][capacity] table
pt: Constrói tabela dp[item][capacidade]

# dpBullet2
source: Guarantees optimal solution
pt: Garante solução ótima

# dpBullet3
source: Time complexity ~ O(n * capacity)
pt: Complexidade ~ O(n * capacidade)

# optimalBadge
source: Optimal
pt: Ótimo

# bruteforceTitle
source: Backtracking / Brute Force
pt: Backtracking / Força Bruta

# bruteforceSubtitle
source: Explores combinations
pt: Explora combinações possíveis

# bruteforceBullet1
source: Demonstrates combinatorial explosion
pt: Mostra explosão combinatória

# bruteforceBullet2
source: Useful for learning
pt: Ótimo para aprendizado

# bruteforceBullet3
source: Becomes slow quickly
pt: Fica lento rapidamente

# didacticBadge
source: Didactic
pt: Didático

# resultTitle
source: Result
pt: Resultado

# capacityLabel
source: Capacity
pt: Capacidade

# usedWeightLabel
source: Used Weight
pt: Peso usado

# failBadge
source: Needs Improvement
pt: Precisa melhorar

# okBadge
source: Good
pt: Bom

# greatBadge
source: Excellent
pt: Excelente

# percentageOfOptimal
source: You reached {percent}% of optimal
pt: Você fez {percent}% do ótimo

source: Retry
pt: Tentar novamente

source: Next Level
pt: Próximo nível

source: Suggestion
pt: Sugestão

source: View Optimal Solution
pt: Ver solução ótima

# knapsackGuideHeroBadge
source: Knapsack Problem
pt: Problema da Mochila

# knapsackGuideHeroTitle
source: Pick items and maximize value without exceeding capacity.
pt: Escolha itens e maximize o valor sem passar do peso.

# knapsackGuideHeroSubtitle
source: Understand the context and algorithms before playing.
pt: Entenda o contexto e os algoritmos antes de jogar.

# knapsackPlayTitle
source: Game: Knapsack
pt: Jogo: Mochila

# knapsackPlayResetTooltip
source: Reset
pt: Reiniciar

# knapsackPlayHintBeginner
source: Tip: try combining light items with high value.
pt: Dica: tente colocar itens leves com bom valor. Combine bem!

# knapsackPlayHintIntermediate
source: Tip: the most valuable item is not always the best choice.
pt: Dica: nem sempre o item mais valioso é a melhor escolha.

# knapsackPlayHintAdvanced
source: Tip: maximize efficiency (value/weight).
pt: Dica: maximize eficiência (valor/peso).

# knapsackPlaySelectedTitle
source: In your backpack (tap to remove)
pt: Na mochila (toque para remover)

# knapsackPlayAvailableTitle
source: Available items (drag)
pt: Itens disponíveis (arraste)

# knapsackPlayJumpLeftTooltip
source: Previous item
pt: Voltar 1 item

# knapsackPlayJumpRightTooltip
source: Next item
pt: Avançar 1 item

# knapsackPlayScrollHintLabel
source: Swipe
pt: Deslize

# knapsackPlayFinishCta
source: Finish
pt: Finalizar

# knapsackPlayNoItemSelected
source: No item was selected yet
pt: Nenhum item selecionado ainda.

# knapsackPlayTap
source: Tap
pt: Toque

# knapsackPlayDropHere
source: Drop here!
pt: Solte aqui!

# knapsackPlayDragItemstoTheBag
source: Drag the items to the bag
pt: Arraste itens para a mochila

# knapsackResultTitle
source: Result
pt: Resultado

# knapsackResultGreatTitle
source: Great! Excellent decision
pt: Ótimo! Excelente decisão

# knapsackResultOkTitle
source: Ok! Good choice
pt: Ok! Boa escolha

# knapsackResultFailTitle
source: Close! You can improve
pt: Quase lá! Você pode melhorar

# knapsackResultBadgeFail
source: FAIL
pt: REPROVADO

# knapsackResultBadgeGreat
source: GREAT
pt: ÓTIMO

# knapsackResultOptimalDpLabel
source: Optimal (DP)
pt: Ótimo (DP)

# knapsackResultGapLabel
source: Gap
pt: Lacuna

# knapsackResultSeeOptimalCta
source: See optimal solution (DP)
pt: Ver solução ótima (DP)

# knapsackResultRetryCta
source: Retry
pt: Tentar novamente

# knapsackResultNextLevelCta
source: Next level
pt: Próximo nível

# knapsackResultPctOfOptimal
source: {pct}% of optimal
pt: {pct}% do ideal

# knapsackResultCapacityUsedWeight
source: Capacity: {cap} • Used weight: {used}
pt: Capacidade: {cap} • Peso usado: {used}

# knapsackResultValue
source: Value: {value}
pt: Valor: {value}

# knapsackResultSuggestionLeftoverWithItem
source: You left {waste} capacity unused. Try adding "{name}" (weight {weight}, value {value}).
pt: Você deixou {waste} de capacidade sobrando. Tente adicionar "{name}" (peso {weight}, valor {value}).

# knapsackResultSuggestionLeftoverGeneric
source: You left {waste} capacity unused. Try adding a light item to increase value.
pt: Você deixou {waste} de capacidade sem uso. Tente adicionar um item leve para aumentar o valor.

# knapsackResultSuggestionTryInclude
source: Tip: optimal solutions often include "{name}" (weight {weight}, value {value}). Try swapping items to fit it.
pt: Dica: soluções ótimas geralmente incluem "{name}" (peso {weight}, valor {value}). Tente trocar os itens para se adequar.

# knapsackResultSuggestionGenericLow
source: Try prioritizing items with better value-to-weight ratio (⭐/💪). Heavier items are not always worth it.
pt: Tente priorizar itens com melhor relação valor-peso (⭐/💪). Itens mais pesados ​​nem sempre valem a pena.

# knapsackResultOptimalSheetTitle
source: Optimal solution (DP)
pt: Solução ótima (DP)

# profileScreenSoon
source: Profile (coming soon)
pt: Perfil (em breve)

# tpsScreenSoon
source: Introduction to The Traveling Salesman (coming soon)
pt: Introdução ao Caixeiro Viajante (em breve)
